In [3]:
import pandas as pd
import numpy as np

In [4]:
dict = {'Col1':[1,2,3,np.nan],
 'Col2':[4,np.nan,6,7],
 "Col3":['a','b','c', None]}

In [6]:
df = pd.DataFrame(dict)

In [7]:
df

   Col1  Col2  Col3
0   1.0   4.0     a
1   2.0   NaN     b
2   3.0   6.0     c
3   NaN   7.0  None

In [8]:
df.isnull()

    Col1   Col2   Col3
0  False  False  False
1  False   True  False
2  False  False  False
3   True  False   True

In [23]:
df.isnull()*1 #Poner los datos nulos en uno

   Col1  Col2  Col3
0     0     0     0
1     0     1     0
2     0     0     0
3     1     0     1

In [22]:
df.fillna('Missing') #Poner la palabra mising en datos nulos

      Col1     Col2     Col3
0      1.0      4.0        a
1      2.0  Missing        b
2      3.0      6.0        c
3  Missing      7.0  Missing

In [21]:
df.fillna(df.mean()) #poner la media en datos nulos

/tmp/ipykernel_16808/4289136084.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.fillna(df.mean()) #poner la media en datos nulos

   Col1      Col2  Col3
0   1.0  4.000000     a
1   2.0  5.666667     b
2   3.0  6.000000     c
3   2.0  7.000000  None

In [20]:
df.interpolate() #autocompletado los datos

   Col1  Col2  Col3
0   1.0   4.0     a
1   2.0   5.0     b
2   3.0   6.0     c
3   3.0   7.0  None

In [19]:
df.dropna() #borrando los datos nulos

   Col1  Col2 Col3
0   1.0   4.0    a
2   3.0   6.0    c